//ID,スキル名,難易度,前提ID1,前提LV1,前提ID2,前提LV2,前提ID3,前提LV3,前提ID4,前提LV4,前提ID5,前提LV5
//skill_common.jsの2016/7/30版が必要
var b6l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=';
var RS;

function dec(s){
  var t = '', p = -8, a = 0, c, d;
  for( var i = 0; i < s.length; i++ ) {
    if ( ( c = b6l.indexOf(s.charAt(i)) ) < 0 )
      continue;
    a = (a<<6)|(c&63);
    if ( ( p += 6 ) >= 0 ) {
      d = (a>>p)&255;
      if ( c != 64 )
        t += String.fromCharCode(d);
      a &= 63;
      p -= 8;
    }
  }
  RS=true;
  return t;
}

JN = new Array(9);
JN[0]="soul";
JN[1]="霊術師";
JN[2]="闘士";
JN[3]="シャーマンオブウィンド";
JN[4]="ソウルコントローラー";
JN[5]="スピリットインプリケイショナ";
JN[6]="フォースグラップラー";
JN[7]="ダンシングレイジス";
JN[8]="ファーストアブソーバ";
if(!rswitch){JN = new Array(0); }
SS = new Array(69,0);
SS[0]=new Array("無",0,0,0,0,0,0,0,0,0,0,0);
SS[1]=new Array("斜め斬り",1,0,0,0,0,0,0,0,0,0,0);
SS[2]=new Array("必殺斬り",2,1,6,0,0,0,0,0,0,0,0);
SS[3]=new Array("竜巻起こし",3,2,6,7,3,0,0,0,0,0,0);
SS[4]=new Array("乱斬り",4,1,12,3,6,0,0,0,0,0,0);
SS[5]=new Array("嵐斬り",5,1,24,3,12,8,6,0,0,0,0);
SS[6]=new Array("脚斬り",1,1,3,0,0,0,0,0,0,0,0);
SS[7]=new Array("腕斬り",2,6,6,2,3,0,0,0,0,0,0);
SS[8]=new Array("胴斬り",3,7,6,3,6,0,0,0,0,0,0);
SS[9]=new Array("魂斬り",4,6,12,8,6,0,0,0,0,0,0);
SS[10]=new Array("真空斬り",5,6,24,8,12,9,3,0,0,0,0);
SS[11]=new Array("アセンブル",1,1,6,0,0,0,0,0,0,0,0);
SS[12]=new Array("リバレイト",2,11,6,0,0,0,0,0,0,0,0);
SS[13]=new Array("アブソーブ",3,12,10,0,0,0,0,0,0,0,0);
SS[14]=new Array("サンクチュアリ",4,11,12,13,10,0,0,0,0,0,0);
SS[15]=new Array("魂の暴走",5,11,24,14,6,0,0,0,0,0,0);
SS[16]=new Array("クルーエルソウル",5,20,12,0,0,0,0,0,0,0,0);
SS[17]=new Array("スクリームソウル",1,11,6,2,3,0,0,0,0,0,0);
SS[18]=new Array("ワンダーソウル",2,17,6,0,0,0,0,0,0,0,0);
SS[19]=new Array("神隠し",4,20,6,0,0,0,0,0,0,0,0);
SS[20]=new Array("レイジソウル",3,18,6,0,0,0,0,0,0,0,0);
SS[21]=new Array("ソウルプランダー",1,18,6,20,3,0,0,0,0,0,0);
SS[22]=new Array("魂の侵食",3,21,12,23,3,0,0,0,0,0,0);
SS[23]=new Array("メネシス",2,21,6,0,0,0,0,0,0,0,0);
SS[24]=new Array("魂のスイッチ",4,22,3,0,0,0,0,0,0,0,0);
SS[25]=new Array("ソウルブレイズ",5,24,6,0,0,0,0,0,0,0,0);

SS[26]=new Array("ポゼッション・ブル",1,0,0,0,0,0,0,0,0,0,0);
SS[27]=new Array("ポゼッション・ホーク",2,26,6,0,0,0,0,0,0,0,0);
SS[28]=new Array("ポゼッション・ベア",1,26,3,0,0,0,0,0,0,0,0);
SS[29]=new Array("ポゼッション・スネーク",1,28,5,0,0,0,0,0,0,0,0);
SS[30]=new Array("ポゼッション・ピューマ",2,29,3,0,0,0,0,0,0,0,0);
SS[31]=new Array("蛇の目拳",2,29,5,0,0,0,0,0,0,0,0);
SS[32]=new Array("鷹の目拳",3,26,12,27,6,0,0,0,0,0,0);
SS[33]=new Array("大熊拳",3,28,12,30,6,0,0,0,0,0,0);
SS[34]=new Array("猛牛拳",3,30,12,31,12,0,0,0,0,0,0);
SS[35]=new Array("ピューマアタック",4,30,12,31,12,0,0,0,0,0,0);
SS[36]=new Array("雷撃破",4,34,6,43,6,0,0,0,0,0,0);
SS[37]=new Array("双連破",5,35,6,0,0,0,0,0,0,0,0);
SS[38]=new Array("竜撃破",5,37,6,0,0,0,0,0,0,0,0);
SS[39]=new Array("プラズマボルト",5,38,3,44,3,0,0,0,0,0,0);
SS[40]=new Array("桜吹雪",5,39,3,0,0,0,0,0,0,0,0);
SS[41]=new Array("コンセントレーション",1,32,3,0,0,0,0,0,0,0,0);
SS[42]=new Array("リフレクション",2,41,6,0,0,0,0,0,0,0,0);
SS[43]=new Array("半月いなし",3,41,12,42,3,0,0,0,0,0,0);
SS[44]=new Array("胴砕き",4,43,8,0,0,0,0,0,0,0,0);
SS[45]=new Array("覚醒",5,44,12,0,0,0,0,0,0,0,0);
SS[46]=new Array("ピューマラッシュ",1,31,3,32,3,33,3,34,3,0,0);
SS[47]=new Array("スネークマジック",2,46,10,0,0,0,0,0,0,0,0);
SS[48]=new Array("ビーストハート",3,47,10,0,0,0,0,0,0,0,0);
SS[49]=new Array("ホークアイ",4,48,10,0,0,0,0,0,0,0,0);
SS[50]=new Array("神撃破",5,49,10,0,0,0,0,0,0,0,0);

SS[51]=new Array("大嵐斬り",6,5,50,0,50,0,1,0,1,0,1);
SS[52]=new Array("竜神昇",6,3,50,0,50,0,1,0,1,0,1);
SS[53]=new Array("鬼斬り",6,2,50,0,50,0,1,0,1,0,1);
SS[54]=new Array("ソウルカタストロフィ",6,15,50,0,50,0,1,0,1,0,1);
SS[55]=new Array("フルリバレイト",6,12,50,0,50,0,1,0,1,0,1);
SS[56]=new Array("稲妻乱切り",6,4,50,0,50,0,1,0,1,0,1);
SS[57]=new Array("マインドアプリクション",6,25,50,0,50,0,1,0,1,0,1);
SS[58]=new Array("ソウルテイナー",6,21,50,0,50,0,1,0,1,0,1);
SS[59]=new Array("魂の繋縛",6,22,50,0,50,0,1,0,1,0,1);

SS[60]=new Array("覇鷹拳",6,32,50,0,50,0,1,0,1,0,1);
SS[61]=new Array("鳳凰連破",6,37,50,0,50,0,1,0,1,0,1);
SS[62]=new Array("秘儀・雷撃破",6,36,50,0,50,0,1,0,1,0,1);
SS[63]=new Array("プラズマブラスト",6,39,50,0,50,0,1,0,1,0,1);
SS[64]=new Array("覇蛇拳",6,31,50,0,50,0,1,0,1,0,1);
SS[65]=new Array("明鏡止水",6,45,50,0,50,0,1,0,1,0,1);
SS[66]=new Array("秘儀・竜撃破",6,38,50,0,50,0,1,0,1,0,1);
SS[67]=new Array("ピューマぺスティネイション",6,35,50,0,50,0,1,0,1,0,1);
SS[68]=new Array("覇熊拳",6,33,50,0,50,0,1,0,1,0,1);
