//ID,スキル名,難易度,前提ID1,前提LV1,前提ID2,前提LV2,前提ID3,前提LV3,前提ID4,前提LV4,前提ID5,前提LV5
//skill_common.jsの2016/7/30版が必要
var b6l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=';
var RS;

function dec(s){
  var t = '', p = -8, a = 0, c, d;
  for( var i = 0; i < s.length; i++ ) {
    if ( ( c = b6l.indexOf(s.charAt(i)) ) < 0 )
      continue;
    a = (a<<6)|(c&63);
    if ( ( p += 6 ) >= 0 ) {
      d = (a>>p)&255;
      if ( c != 64 )
        t += String.fromCharCode(d);
      a &= 63;
      p -= 8;
    }
  }
  RS=true;
  return t;
}

JN = new Array(9);
JN[0]="opticalist";
JN[1]="光奏師";
JN[2]="獣人";
JN[3]="ルミナスモナーク";
JN[4]="クリスタルオペレータ";
JN[5]="ラディアンスコーディネーター";
JN[6]="イリュージョナリーアサルター";
JN[7]="スラッシングスプリッター";
JN[8]="ラストラスピアサー";
if(!rswitch){JN = new Array(0); }
SS = new Array(69,0);
SS[0]=new Array("無",0,0,0,0,0,0,0,0,0,0,0);
SS[1]=new Array("シューティングライト",1,0,0,0,0,0,0,0,0,0,0);
SS[2]=new Array("リフレクトライト",3,1,11,0,0,0,0,0,0,0,0);
SS[3]=new Array("スプレットビーム",4,1,15,2,8,6,8,0,0,0,0);
SS[4]=new Array("クリムゾン・アイ",5,7,13,3,12,9,7,0,0,0,0);
SS[5]=new Array("オプティカルホール",5,4,6,10,10,14,5,0,0,0,0);
SS[6]=new Array("速読",1,0,0,0,0,0,0,0,0,0,0);
SS[7]=new Array("メルティングアイズ",2,6,7,0,0,0,0,0,0,0,0);
SS[8]=new Array("バイタリゼーション",3,7,5,2,8,0,0,0,0,0,0);
SS[9]=new Array("光のカーテン",3,7,6,8,8,3,5,0,0,0,0);
SS[10]=new Array("タイムコントロール",4,4,5,0,0,0,0,0,0,0,0);
SS[11]=new Array("ビットショット",1,0,0,0,0,0,0,0,0,0,0);
SS[12]=new Array("トリプルクラッチ",2,11,5,0,0,0,0,0,0,0,0);
SS[13]=new Array("ダブルエフェクト",2,11,14,2,8,0,0,0,0,0,0);
SS[14]=new Array("デストラクション",4,21,5,12,5,0,0,0,0,0,0);
SS[15]=new Array("蜂の巣",5,14,5,23,8,16,5,0,0,0,0);
SS[16]=new Array("エクスパンション",4,11,15,12,9,0,0,0,0,0,0);
SS[17]=new Array("ラジエーション",2,16,4,21,6,0,0,0,0,0,0);
SS[18]=new Array("クラッキング",3,17,7,0,0,0,0,0,0,0,0);
SS[19]=new Array("スラッシング",4,18,9,14,3,0,0,0,0,0,0);
SS[20]=new Array("エクスプロージョン",5,15,5,23,10,0,0,0,0,0,0);
SS[21]=new Array("スティッキー",2,12,5,0,0,0,0,0,0,0,0);
SS[22]=new Array("光化学",3,8,5,0,0,0,0,0,0,0,0);
SS[23]=new Array("カウンターオフェンシブ",1,21,8,17,5,0,0,0,0,0,0);
SS[24]=new Array("リベレーションコード",5,3,5,18,5,0,0,0,0,0,0);
SS[25]=new Array("アウェイクニング",4,2,5,12,5,0,0,0,0,0,0);

SS[26]=new Array("クロスアタック",1,0,0,0,0,0,0,0,0,0,0);
SS[27]=new Array("アンクルロブ",1,26,6,0,0,0,0,0,0,0,0);
SS[28]=new Array("アンビートツインアタック",3,26,6,27,6,0,0,0,0,0,0);
SS[29]=new Array("ファイナライジングファウンド",4,26,24,27,12,28,6,0,0,0,0);
SS[30]=new Array("パニッシュメントクロス",4,26,12,27,6,28,6,50,3,0,0);
SS[31]=new Array("イリュージョンシュート",1,0,0,0,0,0,0,0,0,0,0);
SS[32]=new Array("イリュージョンハープン",2,31,6,0,0,0,0,0,0,0,0);
SS[33]=new Array("ブレードシャワー",3,31,12,32,6,0,0,0,0,0,0);
SS[34]=new Array("マルチブーメランシュート",4,32,12,33,12,26,6,0,0,0,0);
SS[35]=new Array("ファントムストーム",5,31,24,32,12,50,12,34,6,0,0);
SS[36]=new Array("シャドーオーバーステップ",3,26,12,50,6,0,0,0,0,0,0);
SS[37]=new Array("ビジョンドッペルゲンガー",4,29,12,50,12,31,6,0,0,0,0);
SS[38]=new Array("ファンタズムイベーション",3,50,12,36,6,0,0,0,0,0,0);
SS[39]=new Array("シャドウカーテン",5,36,24,40,12,38,6,37,6,0,0);
SS[40]=new Array("ハイルネイションスモーク",3,36,12,37,6,0,0,0,0,0,0);
SS[41]=new Array("スウェフトダンブリング",3,26,6,50,6,0,0,0,0,0,0);
SS[42]=new Array("エアリアルバースト",2,26,6,31,6,0,0,0,0,0,0);
SS[43]=new Array("ショックリバレイション",2,26,12,36,6,0,0,0,0,0,0);
SS[44]=new Array("トーマントカウンター",5,34,12,45,12,28,6,0,0,0,0);
SS[45]=new Array("ユニコーンズロア",4,46,12,47,6,0,0,0,0,0,0);
SS[46]=new Array("ウィニンググルーブ",2,50,12,0,0,0,0,0,0,0,0);
SS[47]=new Array("スパイラルホーン",5,50,24,46,12,43,6,0,0,0,0);
SS[48]=new Array("ミラージュウォール",4,27,24,33,6,0,0,0,0,0,0);
SS[49]=new Array("イリュージョンサクリファイス",3,36,12,37,6,0,0,0,0,0,0);
SS[50]=new Array("ブレードグライディング",1,0,0,0,0,0,0,0,0,0,0);

SS[51]=new Array("クリムゾン・アイ【改】",6,4,50,0,50,0,1,0,1,0,1);
SS[52]=new Array("エクステンドビーム",6,3,50,0,50,0,1,0,1,0,1);
SS[53]=new Array("バウンドライト",6,2,50,0,50,0,1,0,1,0,1);
SS[54]=new Array("ビットブラスト",6,20,50,0,50,0,1,0,1,0,1);
SS[55]=new Array("ディフュージョン",6,16,50,0,50,0,1,0,1,0,1);
SS[56]=new Array("蜂の巣【改】",6,15,50,0,50,0,1,0,1,0,1);
SS[57]=new Array("タイムドミネーター",6,10,50,0,50,0,1,0,1,0,1);
SS[58]=new Array("光のレガリア",6,9,50,0,50,0,1,0,1,0,1);
SS[59]=new Array("インビゴレイト",6,8,50,0,50,0,1,0,1,0,1);

SS[60]=new Array("トレースアクロス",6,30,50,0,50,0,1,0,1,0,1);
SS[61]=new Array("ファイナライジングプレッシャー",6,29,50,0,50,0,1,0,1,0,1);
SS[62]=new Array("ヘリカルホーン",6,47,50,0,50,0,1,0,1,0,1);
SS[63]=new Array("ファントムブラッドストーム",6,35,50,0,50,0,1,0,1,0,1);
SS[64]=new Array("ハルシネイションスモッグ",6,40,50,0,50,0,1,0,1,0,1);
SS[65]=new Array("ユニコーンズクライング",6,45,50,0,50,0,1,0,1,0,1);
SS[66]=new Array("アゲインストフィアー",6,44,50,0,50,0,1,0,1,0,1);
SS[67]=new Array("ファンタズムアボイド",6,38,50,0,50,0,1,0,1,0,1);
SS[68]=new Array("ソードバリケード",6,48,50,0,50,0,1,0,1,0,1);
