//ID,スキル名,難易度,前提ID1,前提LV1,前提ID2,前提LV2,前提ID3,前提LV3,前提ID4,前提LV4,前提ID5,前提LV5
//skill_common.jsの2016/7/30版が必要
var b6l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=';
var RS;

function dec(s){
  var t = '', p = -8, a = 0, c, d;
  for( var i = 0; i < s.length; i++ ) {
    if ( ( c = b6l.indexOf(s.charAt(i)) ) < 0 )
      continue;
    a = (a<<6)|(c&63);
    if ( ( p += 6 ) >= 0 ) {
      d = (a>>p)&255;
      if ( c != 64 )
        t += String.fromCharCode(d);
      a &= 63;
      p -= 8;
    }
  }
  RS=true;
  return t;
}

JN = new Array(9);
JN[0]="captain";
JN[1]="キャプテン";
JN[2]="？？？";
JN[3]="ワールウィンド";
JN[4]="レイジングウェーブ";
JN[5]="チェイスストライカー";
JN[6]="覚醒１";
JN[7]="覚醒２";
JN[8]="覚醒３";

SS = new Array(69,0);

SS = new Array(69,0);
SS[0] = new Array("無", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
// 難易度, [{skillid:X, skillLv:Y}...]
SS[1]=new Array("錨落とし",1,0,0,0,0,0,0,0,0,0,0);
SS[2]=new Array("ハードスパイク",2,1,6,0,0,0,0,0,0,0,0);
SS[3]=new Array("ミラージュスパイク",3,1,12,2,6,0,0,0,0,0,0);
SS[4]=new Array("アンカレジ",5,1,24,2,12,3,6,25,12,0,0);
SS[5]=new Array("アンカースウィング",2,1,3,0,0,0,0,0,0,0,0);
SS[6]=new Array("アンカーフック",3,5,6,0,0,0,0,0,0,0,0);
SS[7]=new Array("アンカーサーフィン",4,5,12,6,6,24,6,0,0,0,0);
SS[8]=new Array("サージングウェーブ",5,5,24,6,12,7,6,25,6,0,0);
SS[9]=new Array("アクアポンプ",2,1,3,0,0,0,0,0,0,0,0);
SS[10]=new Array("レインフォッグ",3,9,6,24,3,0,0,0,0,0,0);
SS[11]=new Array("ディセムバーキング",4,9,24,10,12,25,6,0,0,0,0);
SS[12]=new Array("セーラーマインド",3,24,6,0,0,0,0,0,0,0,0);
SS[13]=new Array("ラッキーストライク",4,25,12,4,6,0,0,0,0,0,0);
SS[14]=new Array("チェーンワインド",4,25,6,8,6,0,0,0,0,0,0);
SS[15]=new Array("リップタイド",3,25,12,11,6,0,0,0,0,0,0);
SS[16]=new Array("やり手",2,23,6,0,0,0,0,0,0,0,0);
SS[17]=new Array("度胸がある者",3,16,6,0,0,0,0,0,0,0,0);
SS[18]=new Array("ストーンスキン",4,16,12,17,6,0,0,0,0,0,0);
SS[19]=new Array("フラッドタイド",3,2,12,10,6,0,0,0,0,0,0);
SS[20]=new Array("ロータイド",4,2,12,10,12,0,0,0,0,0,0);
SS[21]=new Array("フルノット",5,19,24,20,12,0,0,0,0,0,0);
SS[22]=new Array("ルールオーバー",4,18,12,25,12,0,0,0,0,0,0);
SS[23]=new Array("一口",1,0,0,0,0,0,0,0,0,0,0);
SS[24]=new Array("酒好き",2,23,6,0,0,0,0,0,0,0,0);
SS[25]=new Array("酒豪",3,23,12,24,6,0,0,0,0,0,0);

SS[26]=new Array("錨落とし",1,0,0,0,0,0,0,0,0,0,0);
SS[27]=new Array("ハードスパイク",2,26,7,0,0,0,0,0,0,0,0);
SS[28]=new Array("ミラージュスパイク",2,26,12,50,6,0,0,0,0,0,0);
SS[29]=new Array("アンカレジ",4,27,24,28,12,0,0,0,0,0,0);
SS[30]=new Array("アンカースウィング",5,26,24,27,18,28,6,29,3,0,0);
SS[31]=new Array("アンカーフック",1,0,0,0,0,0,0,0,0,0,0);
SS[32]=new Array("アンカーサーフィン",3,31,6,50,6,0,0,0,0,0,0);
SS[33]=new Array("サージングウェーブ",4,32,12,40,6,0,0,0,0,0,0);
SS[34]=new Array("アクアポンプ",4,33,12,50,12,29,6,0,0,0,0);
SS[35]=new Array("レインフォッグ",5,31,24,33,12,50,12,34,6,0,0);
SS[36]=new Array("ディセムバーキング",3,31,12,50,6,0,0,0,0,0,0);
SS[37]=new Array("セーラーマインド",3,36,6,50,12,0,0,0,0,0,0);
SS[38]=new Array("ラッキーストライク",3,37,6,50,18,0,0,0,0,0,0);
SS[39]=new Array("チェーンワインド",4,50,18,36,12,37,6,0,0,0,0);
SS[40]=new Array("リップタイド",5,26,12,31,12,48,6,0,0,0,0);
SS[41]=new Array("やり手",4,26,6,31,6,0,0,0,0,0,0);
SS[42]=new Array("度胸がある者",5,36,6,37,4,38,2,0,0,0,0);
SS[43]=new Array("ストーンスキン",5,28,12,29,8,30,4,0,0,0,0);
SS[44]=new Array("フラッドタイド",5,33,12,34,8,35,4,0,0,0,0);
SS[45]=new Array("ロータイド",5,50,24,47,18,46,18,0,0,0,0);
SS[46]=new Array("フルノット",2,50,8,0,0,0,0,0,0,0,0);
SS[47]=new Array("ルールオーバー",3,50,14,26,7,31,7,0,0,0,0);
SS[48]=new Array("一口",4,50,24,37,6,0,0,0,0,0,0);
SS[49]=new Array("酒好き",4,50,12,38,6,0,0,0,0,0,0);
SS[50]=new Array("酒豪",1,0,0,0,0,0,0,0,0,0,0);

SS[51]=new Array("チェーンレインフォース",6,14,50,0,50,0,1,0,1,0,1);
SS[52]=new Array("ドラスティックウェーブ",6,8,50,0,50,0,1,0,1,0,1);
SS[53]=new Array("アンカートルネード",6,7,50,0,50,0,1,0,1,0,1);
SS[54]=new Array("グレイトディセムバーキング",6,11,50,0,50,0,1,0,1,0,1);
SS[55]=new Array("アクアランチャー",6,9,50,0,50,0,1,0,1,0,1);
SS[56]=new Array("スチームフォッグ",6,10,50,0,50,0,1,0,1,0,1);
SS[57]=new Array("アンカープル",6,6,50,0,50,0,1,0,1,0,1);
SS[58]=new Array("ハードアンカレジ",6,4,50,0,50,0,1,0,1,0,1);
SS[59]=new Array("大酒家",6,25,50,0,50,0,1,0,1,0,1);

SS[60]=new Array("チェーンレインフォース",6,43,50,0,50,0,1,0,1,0,1);
SS[61]=new Array("ドラスティックウェーブ",6,30,50,0,50,0,1,0,1,0,1);
SS[62]=new Array("アンカートルネード",6,29,50,0,50,0,1,0,1,0,1);
SS[63]=new Array("グレイトディセムバーキング",6,35,50,0,50,0,1,0,1,0,1);
SS[64]=new Array("アクアランチャー",6,32,50,0,50,0,1,0,1,0,1);
SS[65]=new Array("スチームフォッグ",6,44,50,0,50,0,1,0,1,0,1);
SS[66]=new Array("アンカープール",6,40,50,0,50,0,1,0,1,0,1);
SS[67]=new Array("ハードアンカレジ",6,39,50,0,50,0,1,0,1,0,1);
SS[68]=new Array("大酒家",6,42,50,0,50,0,1,0,1,0,1);
