
防御	防御力効率 防御力 防御速度
HP	最大HP効率 最大HP HP吸収 HP回復
CP	最大CP効率 最大CP CP減少抑止 CP減少速度 CPボーナス CP変換
属性攻撃	火属性攻撃 水属性攻撃 風属性攻撃 土属性攻撃 光属性攻撃 闇属性攻撃
属性抵抗	火属性抵抗 水属性抵抗 風属性抵抗 土属性抵抗 光属性抵抗 闇属性抵抗 全属性抵抗
属性吸収	火属性吸収 水属性吸収 風属性吸収 土属性吸収 光属性吸収 闇属性吸収 全属性吸収
命中・回避	攻撃命中 攻撃回避 ブロック率 命中補正無視 回避補正無視 絶対命中 ターゲット固定
ターゲット回避
特殊攻撃	致命打率 決定打率 ノックアウト 攻撃反射 反射フリーズ 反射コールド フリーズ
コールド スタン 混乱 魅了 石化 即死 眠り 暗闇 知能低下 狂気 武器破壊 防具破壊
各種抵抗	致命打抵抗 決定打抵抗 後退転倒抵抗 低下系抵抗 呪い抵抗 状態異常抵抗 全異常抵抗
フリーズ抵抗 コールド抵抗 スタン抵抗 混乱抵抗 魅了抵抗 石化抵抗 即死抵抗 眠り抵抗
毒抵抗
特殊効果	移動速度 薬回復 敵逃亡 応急処置 変身速度 復活確率 不可視 浮遊 魔法弾丸 無限弾丸
永久弾 魔具入手 レア入手 リロード速度 自動リロード
スキル	職業スキル 全職業スキル スキルEX サマナーEX ペットEX
攻撃段階上昇	火攻撃段階上昇 水撃段階上昇 風攻撃段階上昇 土攻撃段階上昇 光攻撃段階上昇
闇攻撃段階上昇

