// 大体は実装順から追える
skillSpec = {
    0: "混乱",
    1: "防具破壊",
    2: "武器破壊",
    3: "麻痺",
    4: "フリーズ",
    5: "コールド",
    6: "暗闇",
    7: "命中低下",
    8: "回避低下",
    9: "攻撃力",
    10: "防御力",
    11: "ペット命令",
    12: "12",
    13:"攻撃力低下",
    14:"命中率低下",
    15:"回避率低下",
    16:"暗闇",
    17:"命中/回避低下",
    18:"呪い",
    19:"ダミー生成",
    20:"移動速度低下",
    21:"攻撃速度低下",
    22:"命中率",
    23:"回避率",
    24:"移動速度",
    25:"攻撃速度",
    26:"26",
    27:"攻撃力上昇",
    28:"攻撃力%上昇",
    29:"防御力低下", //裏切り用
    30:"防御力低下",
    31:"防御力%低下",
    32:"防御力",
    33:"防御力%",
    34:"異常抵抗",
    35:"低下抵抗",
    36:"呪い抵抗",
    37:"全属性抵抗低下",
    38:"全属性抵抗%低下",
    39:"火抵抗低下",
    40:"水抵抗低下",
    41:"風抵抗低下",
    42:"土抵抗低下",
    43:"光抵抗低下",
    44:"闇抵抗低下",
    45:"魔法抵抗",
    46:"火抵抗",
    47:"水抵抗",
    48:"風抵抗",
    49:"土抵抗",
    50:"光抵抗",
    51:"闇抵抗",
    52:"52",
    53:"集中力",
    54:"集中力",　//ステラビア
    55:"集中力低下", //ノヴァ
    56:"力上昇",
    57:"敏捷上昇",
    58:"健康上昇",
    59:"威厳上昇",
    60:"知識上昇",
    61:"知恵上昇",
    62:"運上昇",
    63:"最大CP",
    64:"最大HP(+)",
    65:"最大HP(%)",
    66:"リジェネ",
    67:"ノックバック",
    68:"移動不可", //ロックバウンディング
    69:"移動不能",
    70:"移動速度低下", 
    71:"麻痺", //アース
    72:"石化",
    73:"毒",
    74:"拡散",
    75:"攻撃力(共鳴)",
    76:"76",
    77:"炎属性付加",
    78:"水属性付加",
    79:"土属性付加",
    80:"風属性付加",
    81:"光属性付加",
    82:"闇属性付加",
    83:"火ダメ",
    84:"水ダメ",
    85:"風ダメ",
    86:"地ダメ",
    87:"光ダメ",
    88:"闇ダメ",
    89:"火持続ダメ",
    90:"水持続ダメ",
    91:"風持続ダメ",
    92:"地持続ダメ",
    93:"光持続ダメ",
    94:"闇持続ダメ",
    95:"敵逃亡",
    96:"アンデッド逃亡",
    97:"アンデッド麻痺",
    98:"アンデッド即死",
    99:"デストロ1",
    100:"デストロ2",
    101:"HP吸収(M)",
    102:"HP回復",
    103:"眠り",
    104:"異常治療",
    105:"呪い治療",
    106:"低下治療",
    107:"憑依",
    108:"索敵",
    109:"装置探知",
    110:"補助魔法解除", // ディスペ
    111:"CP減少",　// (MD・ガルパラ)
    112:"112",
    113:"誘惑",
    114:"歩行状態", //(サンク)
    115:"街移動",　//エバキュエイション
    116:"コーリング",　//(コール)
    117:"タウンポータル", //(タウポ)
    118:"Lv低下",
    119:"Lv上昇",
    120:"120",
    121:"121",
    122:"ペットテイム",
    123:"タゲ回避",
    124:"睨み合い",
    125:"応急処置",
    126:"飼育記録限界Lv",
    127:"経験値上昇(叱)",
    128:"唐辛子",
    129:"129",
    130:"炎攻撃上昇",
    131:"水攻撃上昇",
    132:"風攻撃上昇",
    133:"土攻撃上昇",
    134:"光攻撃上昇",
    135:"闇攻撃上昇",
    136:"純粋魔法攻撃量",　// エレメ
    137:"誘惑低下",
    138:"敵集合",
    139:"ペット奪取",
    140:"召喚",
    141:"召喚パワーアップ",
    142:"犬乗り",
    143:"スキルLv上昇",
    144:"罠",
    145:"ダメージ反射",
    146:"クリティカル率上昇",
    147:"物理ダメ", //（残りHP×）
    148:"アイテム探し",
    149:"アイテム探し",
    150:"Gold探し",
    151:"基本攻撃力低下(M)",
    152:"基本攻撃力上昇",
    153:"基本防御力上昇",
    154:"ターゲット固定?",
    155:"ペットに特技命令",
    156:"麻痺抵抗",
    157:"ダメージ減少", //(防御)
    158:"無敵", //(仰反)
    159:"159",
    160:"異常系異常時間減少",
    161:"#呪い系異常時間減少",
    162:"低下系異常時間減少",
    163:"分身",
    164:"164",
    165:"165",
    166:"右手Lv上昇",
    167:"左手Lv上昇",
    168:"右足Lv上昇",
    169:"左足Lv上昇",
    170:"下蹴Lv上昇",
    171:"毒ダメージ減少", //(スロポ)
    172:"172", //(スロポ)
    173:"173",
    174:"ブラー",
    175:"即死", //(暗殺)
    176:"罠解除", //(ディザ)
    177:"罠探知",
    178:"扉探知", //(扉探知)
    179:"宝開放", //(ロクピ)
    180:"扉開放", //(アンロ)
    181:"ゴールド奪取", //(ピクポ)
    182:"アイテム奪取", //(強奪)
    183:"死の予言",
    184:"ゴールド奪取(M)",
    185:"185",
    186:"アンデッド蘇生",
    187:"ダメージ反射呪",
    188:"蜘蛛の糸",
    189:"移動不能反射",
    190:"闇ダメージ",
    191:"Uバリア",
    192:"店割増値",
    193:"狂気",
    194:"踊り",　//(LD)
    195:"箱に幽閉",
    196:"コピー作成", //(魔描)
    197:"かえる変身",
    198:"198",
    199:"巨大化",
    200:"武器変身",
    201:"うさぎ変身",
    202:"スキップジャンプ",
    203:"死んだぶり",
    204:"トリックキック",
    205:"連鎖攻撃射程",　//(吃驚び)
    206:"属性・全異常抵抗低下",//(花流)
    207:"弾丸属性ダメージ", //(瓶投)
    208:"CP獲得",
    209:"道化師",
    210:"能力入替",
    211:"悪魔の幻影",
    212:"ダメージカット",
    213:"逆鱗",
    214:"吸血",
    215:"針のむしろ",
    216:"蟻地獄",
    217:"PI",
    218:"悪夢",
    219:"烈火",
    220:"降霊mobに命令",
    221:"陰謀の影",
    222:"死の香り",
    223:"引き寄せ",
    224:"ブラブル",
    225:"バイブレ",
    226:"226",
    227:"227",
    228:"228",
    229:"229",
    230:"230",
    231:"約定締結",
    232:"回復率低下",
    233:"復活邪魔",
    234:"ブラッディークロス",
    235:"裏切りの契約",
    236:"魂の誓約",
    237:"血の誓約",
    238:"契約破棄",
    239:"239",
    240:"240",
    241:"241",
    242:"最終攻撃力%上昇",
    243:"243",
    244:"244",
    245:"245",
    246:"246",
    247:"247",
    248:"248",
    249:"249",
    250:"250",
    251:"251",
    252:"252",
    253:"253",
    254:"254",
    255:"魔法アイテムドロップ率上昇",
    256:"Goldドロップ率上昇",
    257:"フィールド火ペナ低下",
    258:"フィールド水ペナ低下",
    259:"フィールド風ペナ低下",
    260:"フィールド土ペナ低下",
    261:"フィールド光ペナ低下",
    262:"フィールド闇ペナ低下",
    263:"装備可能Lv上昇",
    264:"武器装備不可",
    265:"攻撃力低下", //(腕斬)
    266:"スキル発動不可",
    267:"アセンブル",
    268:"全能力上昇",
    269:"防御力・回避率低下",
    270:"致命打攻撃力上昇",
    271:"略奪CP",
    272:"バフ逆転",
    273:"継続火ダメージ",
    274:"火ダメージ", //(レイジ)
    275:"スキルLv1制限",
    276:"次の攻撃の増加",
    277:"277",
    278:"雷撃破持続時間↑",
    279:"279",
    280:"ブロック無効",
    281:"281",
    282:"282",
    283:"283",
    284:"追加ダメージ",
    291: "出血",
    292: "感電",
    462:"追加ダメージ", //イリュージョンスラッシュ
}

/*

0	混乱	混乱
1	防御率↓	防具破壊
2	攻撃率↓	武器破壊
3	麻痺	麻痺
4	氷結	氷結
5	凍結	凍結
6	暗闇	暗闇
7	命中↓	命中率低下
8	回避↓	回避率低下
9	攻撃↑	攻撃力%上昇(攻命)
10	防御↑	防御力%上昇(防命)
11	命令。	ペットに命令
12	12	不明
13	攻撃↓	攻撃力低下
14	命中↓	命中率低下(幻槍)
15	回避↓	回避率低下(幻槍)
16	暗闇	暗闇
17	命避↓	命中/回避率低下
18	呪い	呪い
19	ダミー	ダミー生成(ダミー)
20	移速↓	移動速度低下
21	攻速↓	攻撃速度低下
22	命中↑	命中率上昇
23	回避↑	回避率上昇
24	移速↑	移動速度上昇
25	攻速↑	攻撃速度上昇
26	26	不明
27	攻撃↑	攻撃力上昇
28	攻撃%↑	攻撃力%上昇
29	防御↓	防御力低下(不公正)
30	防御↓	防御力低下
31	防御%↓	防御力%低下
32	防御↑	防御力上昇
33	防御%↑	防御力%上昇
34	異常抵	異常系異常抵抗
35	低下抵	低下系異常抵抗
36	呪い抵	呪い系異常抵抗
37	全低↓	全属性抵抗低下
38	全抵%↓	全属性抵抗%低下
39	水抵↓	#火属性抵抗低下
40	水抵↓	#水属性抵抗低下
41	風抵↓	#風属性抵抗低下
42	土抵↓	土属性抵抗低下
43	光抵↓	光属性抵抗低下
44	闇抵↓	#闇属性抵抗低下
45	全抵↑	全属性抵抗上昇
46	火抵↑	火属性抵抗上昇
47	水抵↑	水属性抵抗上昇
48	風抵↑	風属性抵抗上昇
49	土抵↑	土属性抵抗上昇
50	光抵↑	光属性抵抗上昇
51	闇抵↑	闇属性抵抗上昇
52	？ﾊﾞﾌﾞﾙ	不明
53	集中↑	集中力上昇
54	集中↑	集中力上昇(ステラ)
55	集中↓	集中力低下(ノヴァ)
56	力↑	力上昇
57	敏捷↑	敏捷上昇
58	健康↑	健康上昇
59	威厳↑	威厳上昇
60	知識↑	知識上昇
61	知恵↑	知恵上昇
62	運↑	運上昇
63	CP↑	最大CP上昇
64	HP↑	最大HP上昇
65	HP%↑	最大HP%上昇
66	ﾘｼﾞｪﾈ	リジェネ効果
67	ﾉｯｸﾊﾞｯｸ	ノックバック
68	麻痺	麻痺(ロック)
69	移動不	移動不能\ 
70	移速↓	移動速度低下(グラ)
71	麻痺	麻痺(地震)
72	石化	石化(石触)
73	毒	毒
74	拡散	拡散
75	攻撃↑	攻撃力上昇(共鳴)
76	？ｴｳﾞｨﾙ	不明
77	火付加	炎属性付加(エンチャ)
78	水付加	#水属性付加
79	土付加	#土属性付加
80	風付加	#風属性付加
81	光付加	光属性付加(ブレ)
82	闇付加	闇属性付加
83	火ダメ	#火ダメージ
84	水ダメ	#水ダメージ
85	風ダメ	#風ダメージ
86	地ダメ	地ダメージ
87	光ダメ	#光ダメージ
88	闇ダメ	闇ダメージ
89	火持続	火持続ダメージ
90	水持続	水持続ダメージ
91	風持続	風持続ダメージ
92	地持続	地持続ダメージ
93	光持続	光持続ダメージ
94	闇持続	闇持続ダメージ
95	敵逃亡	敵逃亡(脅)
96	ｱﾝ逃亡	アンデッド逃亡(TU)
97	ｱﾝ麻痺	アンデッド麻痺(TU)
98	ｱﾝ即死	アンデッド即死(TU)
99	デストロ1	デストロ1
100	デストロ2	デストロ2
101	HP吸収?	HP吸収(M)
102	HP回復	HP回復(ホリクロ・運気)
103	眠り	眠り
104	異常自動	異常系異常自動治療
105	呪い自動	呪い系異常自動治療
106	低下自動	低下系異常自動治療
107	憑依	憑依
108	ｽﾆｰｷﾝｸﾞ	索敵(ディテク・足探)
109	装置探知	装置探知
110	魔法解除	補助魔法解除(MD)
111	現CP↓	CP減少(MD・ガルパラ)
112	？Dロア	不明
113	誘惑	誘惑
114	移速変	移動速度変動(サンク)
115	街移動	街移動(エバ)
116	コール	コーリング(コール)
117	タウポ	タウンポータル(タウポ)
118	Lv↓	Lv低下
119	Lv↑	Lv上昇
120	119	不明
121	120	不明
122	ﾃｲﾑ	ペットテイム
123	ﾀｹﾞ回避	タゲ回避
124	睨み合い	睨み合い
125	応急処理	応急処置
126	飼育記録	飼育記録限界Lv
127	経験値↑	経験値上昇(叱)
128	唐辛子	唐辛子
129	128	不明
130	炎攻↑	炎属性攻撃上昇
131	水攻↑	水属性攻撃上昇
132	風攻↑	風属性攻撃上昇
133	地攻↑	土属性攻撃上昇
134	光攻↑	光属性攻撃上昇
135	闇攻↑	闇属性攻撃上昇
136	純攻↑	純粋属性攻撃上昇(エレ)
137	誘惑↓	誘惑低下
138	敵集合	敵集合
139	ﾍﾟｯﾄ奪取	ペット奪取
140	召喚	召喚
141	召喚PW	召喚パワーアップ
142	犬乗り	犬乗り
143	ｽｷﾙLv↑	スキルLv上昇
144	罠	罠
145	ダメ反	ダメージ反射
146	クリ率↑	クリティカル率上昇
147	物理ダメ	物理ダメ（残りHP×）
148	ｱｲﾃﾑ探	アイテム探し
149	ｱｲﾃﾑ探	アイテム探し
150	Gold探	Gold探し
151	基攻↓?	基本攻撃力低下(M)
152	基攻↑	基本攻撃力上昇
153	基防↑	基本防御力上昇
154	ﾀｹﾞ固定	ターゲット固定?
155	命令2	ペットに特技命令
156	麻痺抵	麻痺抵抗
157	ﾀﾞﾒ↓	ダメージ減少(防御)
158	無敵	無敵(仰反)
159	159	不明
160	異常時↓	異常系異常時間減少
161	呪い時↓	#呪い系異常時間減少
162	低下時↓	低下系異常時間減少
163	分身	分身
164	164	不明
165	165	不明(防御)
166	右手Slv↑	右手Lv上昇
167	左手Slv↑	左手Lv上昇
168	右足Slv↑	右足Lv上昇
169	左足Slv↑	左足Lv上昇
170	下蹴Slv↑	下蹴Lv上昇
171	毒ダメ↓	毒ダメージ減少(スロポ)
172	172	不明(スロポ)
173	173	不明
174	ブラー	ブラー
175	即死	即死(暗殺)
176	罠解除	罠解除(ディザ)
177	罠探知	罠探知
178	扉探知	扉探知(扉探知)
179	宝開	宝開放(ロクピ)
180	扉開	扉開放(アンロ)
181	Gold盗	ゴールド奪取(ピクポ)
182	ｱｲﾃﾑ盗	アイテム奪取(強奪)
183	死の予言	死の予\言
184	Gold盗?	ゴールド奪取(M)
185	？ｵｲﾘｰ	不明
186	ｱﾝ蘇生	アンデッド蘇生
187	ダメ反?	ダメージ反射呪
188	蜘蛛の糸	蜘蛛の糸
189	反移不	移動不能\反射
190	闇ダメ	闇ダメージ
191	Uバリア	Uバリア
192	店	店割増値
193	狂気	狂気
194	踊り	踊り(LD)
195	箱幽閉	箱に幽閉
196	ｺﾋﾟｰ	コピー作成(魔描)
197	蛙変身	かえる変身
198	？ポリ	不明
199	巨大化	巨大化
200	武器変身	武器変身
201	兎変身	うさぎ変身
202	ｽｷｯﾌﾟ	スキップジャンプ
203	死まね	死んだぶり
204	ﾄﾘｯｸ	トリックキック
205	連鎖	連鎖攻撃射程(吃驚び)
206	各抵↓	属性・全異常抵抗低下(花流)
207	弾丸ﾀﾞﾒ	弾丸属性ダメージ(瓶投)
208	現CP↑	CP獲得
209	道化師	道化師
210	能力入替	能\力入替
211	悪魔幻影	悪魔の幻影
212	ダメ減少	ダメージカット
213	逆鱗	逆鱗
214	吸血	吸血
215	針	針のむしろ
216	蟻地獄	蟻地獄
217	PI	PI
218	悪夢	悪夢
219	烈火	烈火
220	命令	降霊mobに命令
221	陰謀	陰謀の影
222	死の香り	死の香り
223	引き寄せ	引き寄せ
224	ブラブル	ブラブル
225	バイブレ	バイブレ
226	226	不明
227	227	不明
228	228	不明
229	229	不明
230	230	不明
231	約定	約定締結
232	回復率↓	回復率低下
233	復活邪魔	復活邪魔
234	血十字架	ブラッディークロス
235	裏切契約	裏切りの契約
236	魂誓約	魂の誓約
237	血誓約	血の誓約
238	契約破棄	契約破棄
239	239	不明
240	240	不明
241	241	不明
242	物理Lダメ	最終攻撃力%上昇
243	243	不明
244	244	不明
245	245	不明
246	246	不明
247	247	不明
248	248	不明
249	249	不明
250	250	不明
251	251	不明
252	252	不明
253	253	不明
254	254	不明
255	アイテムD率	魔法アイテムドロップ率上昇
256	GoldD率	Goldドロップ率上昇
257	F火抵抗↑	フィールド火ペナ低下
258	F水抵抗↑	フィールド水ペナ低下
259	F風抵抗↑	フィールド風ペナ低下
260	F土抵抗↑	フィールド土ペナ低下
261	F光抵抗↑	フィールド光ペナ低下
262	F闇抵抗↑	フィールド闇ペナ低下
263	装備可能Lv↑	装備可能Lv上昇
264	武器外し	武器装備不可
265	攻撃↓	攻撃力低下(腕斬)
266	リアク外し	Reスキル発動不可
267	アセンブル	アセンブル
268	全能力↑	全能力上昇
269	防御回避↓	防御力・回避率低下
270	致命打ダメ↑	致命打攻撃力上昇
271	略奪CP	略奪CP
272	Buff逆転	バフ逆転
273	継続火ダメ	継続火ダメージ
274	火ダメ	火ダメージ(レイジ)
275	サイレス	スキルLv1制限
276	次ダメ等↑	次の攻撃の増加
277	277	不明
278	雷撃破↑	雷撃破持続時間↑
279	279	不明
280	ブロック無効	ブロック無効
281	281	不明
282	282	不明
283	283	不明
284	追加ダメ	追加ダメージ
*/