//ID,スキル名,難易度,前提ID1,前提LV1,前提ID2,前提LV2,前提ID3,前提LV3,前提ID4,前提LV4,前提ID5,前提LV5
//skill_common.jsの2016/7/30版が必要
var b6l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=';
var RS;

function dec(s){
  var t = '', p = -8, a = 0, c, d;
  for( var i = 0; i < s.length; i++ ) {
    if ( ( c = b6l.indexOf(s.charAt(i)) ) < 0 )
      continue;
    a = (a<<6)|(c&63);
    if ( ( p += 6 ) >= 0 ) {
      d = (a>>p)&255;
      if ( c != 64 )
        t += String.fromCharCode(d);
      a &= 63;
      p -= 8;
    }
  }
  RS=true;
  return t;
}

JN = new Array(9);
JN[0]="musket";
JN[1]="マスケッティア";
JN[2]="アルケミスト";
JN[3]="ラピッドデスペラード";
JN[4]="アブソリュートヒーター";
JN[5]="アルティメットエンフォーサー";
JN[6]="バーストマニアック";
JN[7]="ホムンクルスマイスター";
JN[8]="クロニクルスカラー";
if(!rswitch){JN = new Array(0); }
SS = new Array(69,0);
SS[0]=new Array("無",0,0,0,0,0,0,0,0,0,0,0);
SS[1]=new Array("レフトファイア",1,0,0,0,0,0,0,0,0,0,0);
SS[2]=new Array("ニーキャッピング",1,1,3,0,0,0,0,0,0,0,0);
SS[3]=new Array("チェックマーク",2,1,6,0,0,0,0,0,0,0,0);
SS[4]=new Array("スクウェアエイム",2,3,3,2,6,0,0,0,0,0,0);
SS[5]=new Array("パラマウントフォーカス",3,1,6,6,6,3,3,4,3,0,0);
SS[6]=new Array("ライトファイア",1,0,0,0,0,0,0,0,0,0,0);
SS[7]=new Array("ターンイットオン",2,6,3,23,3,0,0,0,0,0,0);
SS[8]=new Array("ピールオフ",2,1,6,6,6,7,6,0,0,0,0);
SS[9]=new Array("ヘフティーオプレス",3,6,12,4,6,8,3,0,0,0,0);
SS[10]=new Array("ケアフルチョイス",3,3,12,5,12,7,12,0,0,0,0);
SS[11]=new Array("チェックメイト",4,3,12,5,10,10,6,0,0,0,0);
SS[12]=new Array("アトラクションドロー",5,1,12,6,12,13,12,14,6,11,6);
SS[13]=new Array("リボルバースナップ",2,1,6,23,6,0,0,0,0,0,0);
SS[14]=new Array("チップフォーユー",3,1,12,2,12,3,6,0,0,0,0);
SS[15]=new Array("オーバーブレット",3,6,12,7,10,13,12,14,5,0,0);
SS[16]=new Array("ソーサラーズリロード",1,0,0,0,0,0,0,0,0,0,0);
SS[17]=new Array("エンジュアー",2,16,12,0,0,0,0,0,0,0,0);
SS[18]=new Array("ホロウポイント",1,0,0,0,0,0,0,0,0,0,0);
SS[19]=new Array("インセンディオリーシェル",4,16,18,17,12,18,12,9,6,0,0);
SS[20]=new Array("パーティータイム",5,16,24,17,18,18,12,19,6,0,0);
SS[21]=new Array("アクロバティックガンナー",5,23,24,24,12,8,12,25,10,22,6);
SS[22]=new Array("ウイーゼルアウト",4,23,18,24,12,25,10,15,6,0,0);
SS[23]=new Array("ハングオン",1,1,3,0,0,0,0,0,0,0,0);
SS[24]=new Array("アブゾーブヒート",2,23,6,0,0,0,0,0,0,0,0);
SS[25]=new Array("フォワードヴォリーション",3,24,10,0,0,0,0,0,0,0,0);

SS[26]=new Array("エクスプロード",1,0,0,0,0,0,0,0,0,0,0);
SS[27]=new Array("ダブルデトネイション",2,26,6,0,0,0,0,0,0,0,0);
SS[28]=new Array("フライングエンバー",3,27,3,48,6,0,0,0,0,0,0);
SS[29]=new Array("スパートフレア",4,27,12,28,6,48,12,0,0,0,0);
SS[30]=new Array("アウトバースト",5,27,24,28,18,29,12,47,12,49,12);
SS[31]=new Array("メディカルリキッド",1,48,3,0,0,0,0,0,0,0,0);
SS[32]=new Array("セラピーエリア",3,31,6,48,6,0,0,0,0,0,0);
SS[33]=new Array("フローイングトリートメント",3,31,12,32,6,35,3,0,0,0,0);
SS[34]=new Array("バイタルトランスファー",4,31,24,33,12,35,12,46,12,50,6);
SS[35]=new Array("プロモートリフォーム",2,31,6,46,6,0,0,0,0,0,0);
SS[36]=new Array("ブローイン:ガスティ",2,31,3,48,3,0,0,0,0,0,0);
SS[37]=new Array("ブローイン:ゼフィーロ",3,36,3,49,3,0,0,0,0,0,0);
SS[38]=new Array("ブローイン:アセンディング",4,36,6,37,3,0,0,0,0,0,0);
SS[39]=new Array("ブローイン:スウィフト",5,36,12,37,6,39,6,50,3,0,0);
SS[40]=new Array("ライジングカレント",4,36,6,37,6,38,6,39,6,0,0);
SS[41]=new Array("ビルドトルーパー:イグノア",2,48,6,27,6,0,0,0,0,0,0);
SS[42]=new Array("ビルドタンカー:リアム",2,41,6,46,6,0,0,0,0,0,0);
SS[43]=new Array("ビルドヒーラー:シンシア",2,42,6,31,6,0,0,0,0,0,0);
SS[44]=new Array("ホムンクルスハードニング",3,41,6,42,6,43,6,0,0,0,0);
SS[45]=new Array("エンハンス:ホムンクルス",4,41,12,42,12,43,12,50,6,0,0);
SS[46]=new Array("ディストラスト",3,31,6,0,0,0,0,0,0,0,0);
SS[47]=new Array("ハーフヴァンパイア",2,48,12,46,6,0,0,0,0,0,0);
SS[48]=new Array("インテーク",1,0,0,0,0,0,0,0,0,0,0);
SS[49]=new Array("ディプソジェニック",2,48,6,0,0,0,0,0,0,0,0);
SS[50]=new Array("ドーピング",3,48,12,49,6,0,0,0,0,0,0);

SS[51]=new Array("キングメイト",6,11,50,0,50,0,1,0,1,0,1,608);
SS[52]=new Array("ファジスタントマーク",6,3,50,0,50,0,1,0,1,0,1,624);
SS[53]=new Array("バーストファイヤー",6,4,50,0,50,0,1,0,1,0,1,626);
SS[54]=new Array("カーテンタイム",6,7,50,0,50,0,1,0,1,0,1,765);
SS[55]=new Array("フォーカスドチョイス",6,10,50,0,50,0,1,0,1,0,1,607);
SS[56]=new Array("グランド・フィナーレ",6,12,50,0,50,0,1,0,1,0,1,609);
SS[57]=new Array("グラインディンツポイント",6,18,50,0,50,0,1,0,1,0,1,615);
SS[58]=new Array("パンピングヒット",6,24,50,0,50,0,1,0,1,0,1,766);
SS[59]=new Array("パーティーフルスィング",6,20,50,0,50,0,1,0,1,0,1,618);

SS[60]=new Array("キャタパルトエンバー",6,28,50,0,50,0,1,0,1,0,1, 683);
SS[61]=new Array("アウトブレイク",6,30,50,0,50,0,1,0,1,0,1, 685);
SS[62]=new Array("インフロードフレアー",6,29,50,0,50,0,1,0,1,0,1, 756);
SS[63]=new Array("Bトルーパー : ヒューズイグノア",6,41,50,0,50,0,1,0,1,0,1, 696);
SS[64]=new Array("Bタンカー : ヒューズリアム",6,42,50,0,50,0,1,0,1,0,1, 697);
SS[65]=new Array("Bヒーラー : ヒューズシンシア",6,43,50,0,50,0,1,0,1,0,1, 698);
SS[66]=new Array("ホリフィックエリア",6,32,50,0,50,0,1,0,1,0,1, 759);
SS[67]=new Array("インベックションリキッド",6,31,50,0,50,0,1,0,1,0,1, 760);
SS[68]=new Array("クリーピートリートメント",6,33,50,0,50,0,1,0,1,0,1, 761);
