//ID,スキル名,難易度,前提ID1,前提LV1,前提ID2,前提LV2,前提ID3,前提LV3,前提ID4,前提LV4,前提ID5,前提LV5
//skill_common.jsの2016/7/30版が必要
var b6l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=';
var RS;

function dec(s){
  var t = '', p = -8, a = 0, c, d;
  for( var i = 0; i < s.length; i++ ) {
    if ( ( c = b6l.indexOf(s.charAt(i)) ) < 0 )
      continue;
    a = (a<<6)|(c&63);
    if ( ( p += 6 ) >= 0 ) {
      d = (a>>p)&255;
      if ( c != 64 )
        t += String.fromCharCode(d);
      a &= 63;
      p -= 8;
    }
  }
  RS=true;
  return t;
}

JN = new Array(9);
JN[0]="maid";
JN[1]="メイド";
JN[2]="黒魔術師";
JN[3]="マジェスティックサーバント";
JN[4]="ルナティックサーバント";
JN[5]="アージェントサーバント";
JN[6]="ディアボリックレディ";
JN[7]="オブセッショナルチェイサー";
JN[8]="ラプチュラスエンチャントレス";

SS = new Array(69,0);

SS = new Array(69,0);
SS[0] = new Array("無", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
// 難易度, [{skillid:X, skillLv:Y}...]
SS[1]=new Array("ブルームスイング",1,0,0,0,0,0,0,0,0,0,0);
SS[2]=new Array("ヘビーブルーム",2,3,3,0,0,0,0,0,0,0,0);
SS[3]=new Array("ブルームダスティング",1,0,0,0,0,0,0,0,0,0,0);
SS[4]=new Array("シューティングダスト",3,1,5,0,0,0,0,0,0,0,0);
SS[5]=new Array("ネープルスウェーブ",4,1,5,4,3,0,0,0,0,0,0);
SS[6]=new Array("ブルームアサルト",2,1,7,0,0,0,0,0,0,0,0);
SS[7]=new Array("エクストリームブルームラッシュ",3,2,9,6,7,0,0,0,0,0,0);
SS[8]=new Array("カオスクリーニング",3,5,5,6,6,0,0,0,0,0,0);
SS[9]=new Array("潔癖の乙女",4,7,5,8,15,0,0,0,0,0,0);
SS[10]=new Array("パーフェクトクリーニング",5,6,9,7,12,12,10,0,0,0,0);
SS[11]=new Array("ダストインパクト",2,4,5,8,10,0,0,0,0,0,0);
SS[12]=new Array("掃除の邪魔しちゃダメ",4,1,10,3,10,4,7,5,5,0,0);
SS[13]=new Array("スローイングディッシュ",3,1,7,3,8,5,2,0,0,0,0);
SS[14]=new Array("ブルームスパイラル",4,4,6,8,11,11,5,13,5,0,0);
SS[15]=new Array("マッドラッシュ",5,1,10,3,11,5,12,13,10,0,0);
SS[16]=new Array("インサイト",3,1,3,3,5,0,0,0,0,0,0);
SS[17]=new Array("ストリップドレス",2,1,6,4,8,0,0,0,0,0,0);
SS[18]=new Array("ライフリサイクル",3,4,10,0,0,0,0,0,0,0,0);
SS[19]=new Array("ブルームマスタリー",4,1,10,0,0,0,0,0,0,0,0);
SS[20]=new Array("セーブマイマスター",5,8,15,9,5,18,8,0,0,0,0);
SS[21]=new Array("ナクリエマの加護",2,1,2,0,0,0,0,0,0,0,0);
SS[22]=new Array("掃除の準備：掃き出す",1,1,3,0,0,0,0,0,0,0,0);
SS[23]=new Array("掃除の準備：拭き取る",2,22,6,0,0,0,0,0,0,0,0);
SS[24]=new Array("掃除の準備：殺菌消毒",4,23,10,0,0,0,0,0,0,0,0);
SS[25]=new Array("メイドオブメイド",5,24,5,16,5,19,5,18,5,21,5);

SS[26]=new Array("シューティングチャクラム",1,0,0,0,0,0,0,0,0,0,0);
SS[27]=new Array("バウンスチャクラム",2,26,7,0,0,0,0,0,0,0,0);
SS[28]=new Array("デモンソルジャー",2,26,12,50,6,0,0,0,0,0,0);
SS[29]=new Array("デモンナイト",4,27,24,28,12,0,0,0,0,0,0);
SS[30]=new Array("デモンコマンダー",5,26,24,27,18,28,6,29,3,0,0);
SS[31]=new Array("ブラックファイヤーウェーブ",1,0,0,0,0,0,0,0,0,0,0);
SS[32]=new Array("ブラックスモーク",3,31,6,50,6,0,0,0,0,0,0);
SS[33]=new Array("ブラックヴォルカニックボム",4,32,12,40,6,0,0,0,0,0,0);
SS[34]=new Array("ブラックライトニング",4,33,12,50,12,29,6,0,0,0,0);
SS[35]=new Array("ブラックスター",5,31,24,33,12,50,12,34,6,0,0);
SS[36]=new Array("魔力フィールド：疫病",3,31,12,50,6,0,0,0,0,0,0);
SS[37]=new Array("魔力フィールド：足枷",3,36,6,50,12,0,0,0,0,0,0);
SS[38]=new Array("魔力フィールド：棘",3,37,6,50,18,0,0,0,0,0,0);
SS[39]=new Array("ダストデビル",4,50,18,36,12,37,6,0,0,0,0);
SS[40]=new Array("切滅の円盤",5,26,12,31,12,48,6,0,0,0,0);
SS[41]=new Array("浄化の炎",4,26,6,31,6,0,0,0,0,0,0);
SS[42]=new Array("終わらない苦痛",5,36,6,37,4,38,2,0,0,0,0);
SS[43]=new Array("地下界の武器庫",5,28,12,29,8,30,4,0,0,0,0);
SS[44]=new Array("烙印",5,33,12,34,8,35,4,0,0,0,0);
SS[45]=new Array("位相変異",5,50,24,47,18,46,18,0,0,0,0);
SS[46]=new Array("地下界の女王",2,50,8,0,0,0,0,0,0,0,0);
SS[47]=new Array("ダークエンチャント",3,50,14,26,7,31,7,0,0,0,0);
SS[48]=new Array("シェイドウィング",4,50,24,37,6,0,0,0,0,0,0);
SS[49]=new Array("次元扉の鍵",4,50,12,38,6,0,0,0,0,0,0);
SS[50]=new Array("地下界の魔力源",1,0,0,0,0,0,0,0,0,0,0);

SS[51]=new Array("ネープルスダブルウェーブ",6,5,50,0,50,0,1,0,1,0,1);
SS[52]=new Array("サイクロンブルームス",6,14,50,0,50,0,1,0,1,0,1);
SS[53]=new Array("ディベストドレス",6,17,50,0,50,0,1,0,1,0,1);
SS[54]=new Array("クレイジーラッシュ",6,15,50,0,50,0,1,0,1,0,1);
SS[55]=new Array("アルティメットブルームラッシュ",6,7,50,0,50,0,1,0,1,0,1);
SS[56]=new Array("グライドディッシュ",6,13,50,0,50,0,1,0,1,0,1);
SS[57]=new Array("掃除の邪魔は絶対に許さない",6,12,50,0,50,0,1,0,1,0,1);
SS[58]=new Array("ブルームクラッシャー",6,6,50,0,50,0,1,0,1,0,1);
SS[59]=new Array("カオスクリーニング・改",6,8,50,0,50,0,1,0,1,0,1);

SS[60]=new Array("魔力フィールド：悪疫",6,36,50,0,50,0,1,0,1,0,1);
SS[61]=new Array("デモンマーシャル",6,30,50,0,50,0,1,0,1,0,1);
SS[62]=new Array("地下界の軍勢",6,43,50,0,50,0,1,0,1,0,1);
SS[63]=new Array("ブラックスターオブカラミティ",6,35,50,0,50,0,1,0,1,0,1);
SS[64]=new Array("ダークスモーク",6,32,50,0,50,0,1,0,1,0,1);
SS[65]=new Array("罪深き烙印",6,44,50,0,50,0,1,0,1,0,1);
SS[66]=new Array("破滅の円盤",6,40,50,0,50,0,1,0,1,0,1);
SS[67]=new Array("ストームデビル",6,39,50,0,50,0,1,0,1,0,1);
SS[68]=new Array("魔力フィールド：有刺鉄線",6,38,50,0,50,0,1,0,1,0,1);
