//ID,スキル名,難易度,前提ID1,前提LV1,前提ID2,前提LV2,前提ID3,前提LV3,前提ID4,前提LV4,前提ID5,前提LV5
//skill_common.jsの2016/7/30版が必要
var b6l = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=';
var RS;

function dec(s){
  var t = '', p = -8, a = 0, c, d;
  for( var i = 0; i < s.length; i++ ) {
    if ( ( c = b6l.indexOf(s.charAt(i)) ) < 0 )
      continue;
    a = (a<<6)|(c&63);
    if ( ( p += 6 ) >= 0 ) {
      d = (a>>p)&255;
      if ( c != 64 )
        t += String.fromCharCode(d);
      a &= 63;
      p -= 8;
    }
  }
  RS=true;
  return t;
}

JN = new Array(9);
JN[0]="captain";
JN[1]="キャプテン";
JN[2]="キャノニア";
JN[3]="ワールウィンド";
JN[4]="レイジングウェーブ";
JN[5]="チェイスストライカー";
JN[6]="覚醒１";
JN[7]="覚醒２";
JN[8]="覚醒３";

SS = new Array(69,0);

SS = new Array(69,0);
SS[0] = new Array("無", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
// 難易度, [{skillid:X, skillLv:Y}...]
SS[1]=new Array("錨落とし",1,0,0,0,0,0,0,0,0,0,0);
SS[2]=new Array("ハードスパイク",2,1,6,0,0,0,0,0,0,0,0);
SS[3]=new Array("ミラージュスパイク",3,1,12,2,6,0,0,0,0,0,0);
SS[4]=new Array("アンカレジ",5,1,24,2,12,3,6,25,12,0,0);
SS[5]=new Array("アンカースウィング",2,1,3,0,0,0,0,0,0,0,0);
SS[6]=new Array("アンカーフック",3,5,6,0,0,0,0,0,0,0,0);
SS[7]=new Array("アンカーサーフィン",4,5,12,6,6,24,6,0,0,0,0);
SS[8]=new Array("サージングウェーブ",5,5,24,6,12,7,6,25,6,0,0);
SS[9]=new Array("アクアポンプ",2,1,3,0,0,0,0,0,0,0,0);
SS[10]=new Array("レインフォッグ",3,9,6,24,3,0,0,0,0,0,0);
SS[11]=new Array("ディセムバーキング",4,9,24,10,12,25,6,0,0,0,0);
SS[12]=new Array("セーラーマインド",3,24,6,0,0,0,0,0,0,0,0);
SS[13]=new Array("ラッキーストライク",4,25,12,4,6,0,0,0,0,0,0);
SS[14]=new Array("チェーンワインド",4,25,6,8,6,0,0,0,0,0,0);
SS[15]=new Array("リップタイド",3,25,12,11,6,0,0,0,0,0,0);
SS[16]=new Array("やり手",2,23,6,0,0,0,0,0,0,0,0);
SS[17]=new Array("度胸がある者",3,16,6,0,0,0,0,0,0,0,0);
SS[18]=new Array("ストーンスキン",4,16,12,17,6,0,0,0,0,0,0);
SS[19]=new Array("フラッドタイド",3,2,12,10,6,0,0,0,0,0,0);
SS[20]=new Array("ロータイド",4,2,12,10,12,0,0,0,0,0,0);
SS[21]=new Array("フルノット",5,19,24,20,12,0,0,0,0,0,0);
SS[22]=new Array("ルールオーバー",4,18,12,25,12,0,0,0,0,0,0);
SS[23]=new Array("一口",1,0,0,0,0,0,0,0,0,0,0);
SS[24]=new Array("酒好き",2,23,6,0,0,0,0,0,0,0,0);
SS[25]=new Array("酒豪",3,23,12,24,6,0,0,0,0,0,0);

SS[26]=new Array("キャノンショット",1,0,0,0,0,0,0,0,0,0,0);
SS[27]=new Array("TB-1 グレネード",2,26,6,0,0,0,0,0,0,0,0);
SS[28]=new Array("イフリート-1",3,26,12,27,6,0,0,0,0,0,0);
SS[29]=new Array("モルタルストライク",4,26,24,27,12,28,6,0,0,0,0);
SS[30]=new Array("砲弾強化 : 細裂弾",1,26,3,0,0,0,6,0,0,0,0);
SS[31]=new Array("砲弾強化 : 高爆弾",2,30,6,0,0,0,0,0,0,0,0);
SS[32]=new Array("砲弾強化 : 徹甲弾",4,30,24,31,12,0,0,0,0,0,0);
SS[33]=new Array("ファインサイトキャノネイド",3,29,6,44,12,0,0,0,0,0,0);
SS[34]=new Array("ブリッツゾーン",4,33,12,0,0,0,0,0,0,0,0);
SS[35]=new Array("ライトニングブラスト",5,34,12,0,0,0,0,0,0,0,0);
SS[36]=new Array("ターレットツール",1,26,3,0,0,0,0,0,0,0,0);
SS[37]=new Array("スターシェル",2,36,3,0,0,0,0,0,0,0,0);
SS[38]=new Array("スコーチングロアー",3,36,12,37,6,0,0,0,0,0,0);
SS[39]=new Array("ウィッチネパーム",4,36,24,37,12,38,6,0,0,0,0);
SS[40]=new Array("絨毯爆撃",5,37,24,38,12,39,6,0,0,0,0);
SS[41]=new Array("リコイルショット",4,28,12,0,0,0,0,0,0,0,0);
SS[42]=new Array("アンチフォースフィールド",5,46,24,0,0,0,0,0,0,0,0);
SS[43]=new Array("バレルチューニング",1,27,6,47,3,0,0,0,0,0,0);
SS[44]=new Array("リインフォースターレット",2,36,12,37,6,0,0,0,0,0,0);
SS[45]=new Array("ハイパープレッシャー",3,28,12,38,12,0,0,0,0,0,0);
SS[46]=new Array("リアクティブシールド",4,48,12,0,0,0,0,0,0,0,0);
SS[47]=new Array("デッドショット",1,27,3,0,0,0,0,0,0,0,0);
SS[48]=new Array("アイアンヒール",3,43,6,44,3,0,0,0,0,0,0);
SS[49]=new Array("オーバーロード",4,26,12,36,6,0,0,0,0,0,0);
SS[50]=new Array("オーバークロック",1,49,12,0,0,0,0,0,0,0,0);

SS[51]=new Array("チェーンレインフォース",6,14,50,0,50,0,1,0,1,0,1);
SS[52]=new Array("ドラスティックウェーブ",6,8,50,0,50,0,1,0,1,0,1);
SS[53]=new Array("アンカートルネード",6,7,50,0,50,0,1,0,1,0,1);
SS[54]=new Array("グレイトディセムバーキング",6,11,50,0,50,0,1,0,1,0,1);
SS[55]=new Array("アクアランチャー",6,9,50,0,50,0,1,0,1,0,1);
SS[56]=new Array("スチームフォッグ",6,10,50,0,50,0,1,0,1,0,1);
SS[57]=new Array("アンカープル",6,6,50,0,50,0,1,0,1,0,1);
SS[58]=new Array("ハードアンカレジ",6,4,50,0,50,0,1,0,1,0,1);
SS[59]=new Array("大酒家",6,25,50,0,50,0,1,0,1,0,1);

SS[60]=new Array("砲弾集中強化 : 対戦車弾",6,32,50,0,50,0,1,0,1,0,1);
SS[61]=new Array("砲弾集中強化 : バーブドフラグメント",6,30,50,0,50,0,1,0,1,0,1);
SS[62]=new Array("砲弾集中強化 : 連鎖爆発",6,31,50,0,50,0,1,0,1,0,1);
SS[63]=new Array("ターレットアーキテクト",6,36,50,0,50,0,1,0,1,0,1);
SS[64]=new Array("スティグマシェル",6,37,50,0,50,0,1,0,1,0,1);
SS[65]=new Array("ダスクネパーム",6,39,50,0,50,0,1,0,1,0,1);
SS[66]=new Array("ライトニングトレント",6,35,50,0,50,0,1,0,1,0,1);
SS[67]=new Array("パーフェクトキャノネイド",6,33,50,0,50,0,1,0,1,0,1);
SS[68]=new Array("キルゾーン",6,34,50,0,50,0,1,0,1,0,1);
